### Heroes Of Pymoli Data Analysis
* Of the 1163 active players, the vast majority are male (84%). There also exists, a smaller, but notable proportion of female players (14%).

* Our peak age demographic falls between 20-24 (44.8%) with secondary groups falling between 15-19 (18.60%) and 25-29 (13.4%).  
-----

### Note
* Instructions have been included for each segment. You do not have to follow them exactly, but they are included to help you think through the steps.

In [300]:
# Dependencies and Setup
import pandas as pd
import numpy as np

# File to Load (Remember to Change These)
file_to_load = "Resources/purchase_data.csv"

# Read Purchasing File and store into Pandas data frame
purchase_data = pd.read_csv(file_to_load)

In [301]:
purchase_data.nunique()

Purchase ID    780
SN             576
Age             39
Gender           3
Item ID        183
Item Name      179
Price          145
dtype: int64

In [302]:
purchase_data.describe()

       Purchase ID         Age     Item ID       Price
count   780.000000  780.000000  780.000000  780.000000
mean    389.500000   22.714103   92.114103    3.050987
std     225.310896    6.659444   52.775943    1.169549
min       0.000000    7.000000    0.000000    1.000000
25%     194.750000   20.000000   48.000000    1.980000
50%     389.500000   22.000000   93.000000    3.150000
75%     584.250000   25.000000  139.000000    4.080000
max     779.000000   45.000000  183.000000    4.990000

In [303]:
purchase_data.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

## Player Count

* Display the total number of players

In [304]:
active_players = purchase_data["SN"].nunique()
active_players

576

In [305]:
df

NameError: name 'df' is not defined

In [306]:
total_player_df = pd.DataFrame({"Total Players":[active_players]})

In [307]:
total_player_df

   Total Players
0            576

## Purchasing Analysis (Total)

* Run basic calculations to obtain number of unique items, average price, etc.


* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [308]:
total_players = purchase_data["SN"].count()

In [309]:
unique_item_id = purchase_data["Item ID"].nunique()

In [310]:
unique_item_id

183

In [311]:
item_price = purchase_data.loc[:,"Price"]

In [312]:
total_revenue = round(item_price.sum(),2)

In [313]:
total_revenue

2379.77

In [314]:
Avg_revenue = round(item_price.mean(),2)

In [315]:
Avg_revenue

3.05

In [316]:
Purchasing_Analysis_df = pd.DataFrame({"Number of Unique Items":[unique_item_id], "Average Price": "$" + str(Avg_revenue), "Number of Purchases":[total_players], "Total Revenue": "$" + str(total_revenue)})

In [317]:
Purchasing_Analysis_df

   Number of Unique Items Average Price  Number of Purchases Total Revenue
0                     183         $3.05                  780      $2379.77

## Gender Demographics

* Percentage and Count of Male Players


* Percentage and Count of Female Players


* Percentage and Count of Other / Non-Disclosed

In [318]:
gender_demo = purchase_data[['SN','Gender']]
gender_demo = gender_demo.drop_duplicates('SN', keep = 'first')
gender_demo_test = gender_demo['Gender'].value_counts()
gender_demo_test

Male                     484
Female                    81
Other / Non-Disclosed     11
Name: Gender, dtype: int64

In [319]:
woman = gender_demo.loc[gender_demo["Gender"] == "Female", "Gender"].count()

In [320]:
man = gender_demo.loc[gender_demo["Gender"] == "Male", "Gender"].count()

In [321]:
other = gender_demo.loc[gender_demo["Gender"] == "Other / Non-Disclosed", "Gender"].count()

In [322]:
woman_percentage = round((woman / active_players) * 100, 2)

In [323]:
man_percentage = round((man / active_players) * 100, 2)

In [324]:
other_percentage = round((other / active_players) * 100, 2)

In [325]:
gender_summary = {"Total Count":[man, woman, other], "Percentage of Players":[man_percentage, woman_percentage, other_percentage]}

gender_summary_df = pd.DataFrame(gender_summary, index=['Male', 'Female', 'Other / Non-Disclosed'])

In [326]:
gender_summary_df

                       Total Count  Percentage of Players
Male                           484                  84.03
Female                          81                  14.06
Other / Non-Disclosed           11                   1.91


## Purchasing Analysis (Gender)

* Run basic calculations to obtain purchase count, avg. purchase price, avg. purchase total per person etc. by gender




* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [327]:
woman_PA = purchase_data.loc[purchase_data["Gender"] == "Female", "Gender"].count()

In [328]:
man_PA = purchase_data.loc[purchase_data["Gender"] == "Male", "Gender"].count()

In [329]:
other_PA = purchase_data.loc[purchase_data["Gender"] == "Other / Non-Disclosed", "Gender"].count()

In [330]:
female_analysis = purchase_data.loc[purchase_data["Gender"] == "Female", ["Price"]]

In [331]:
fam = round(float(female_analysis.mean()), 2)

In [332]:
fas = round(float(female_analysis.sum()),2)

In [333]:
male_analysis = purchase_data.loc[purchase_data["Gender"] == "Male", ["Price"]]

In [334]:
male_analysis

     Price
0     3.53
1     1.56
2     4.88
3     3.27
4     1.44
5     3.61
6     2.18
7     2.67
8     1.10
10    4.74
11    2.67
12    4.18
13    1.70
14    4.86
16    2.52
17    1.76
19    4.64
20    4.60
21    1.48
23    3.40
24    3.19
25    4.23
26    1.61
27    3.09
28    4.32
29    3.16
30    2.94
31    4.48
32    4.09
33    2.38
..     ...
746   3.08
748   2.27
749   2.05
750   3.61
751   3.36
752   2.60
753   4.23
755   3.15
756   2.05
757   4.60
758   4.03
759   3.77
760   2.38
761   1.70
762   1.44
763   1.75
764   4.07
765   2.07
766   4.14
768   4.88
769   4.58
770   1.02
771   4.35
772   3.58
773   1.02
774   4.19
776   1.63
777   3.46
778   4.19
779   4.60

[652 rows x 1 columns]

In [335]:
mam = round(float(male_analysis.mean()), 2)

In [336]:
mas = round(float(male_analysis.sum()),2)

In [337]:
other_analysis = purchase_data.loc[purchase_data["Gender"] == "Other / Non-Disclosed", ["Price"]]

In [338]:
oam = round(float(other_analysis.mean()), 2)

In [339]:
oas = round(float(other_analysis.sum()),2)

In [340]:
oas

50.19

In [341]:
purchasing_analysis = {"Purchase Count":[woman_PA, man_PA, other_PA], "Average Purchase Price":[fam, mam, oam], "Total Purchase Value":[fas, mas, oas]}

purchasing_analysis_df = pd.DataFrame(purchasing_analysis, index=['Female', 'Male', 'Other / Non-Disclosed'])

In [342]:
purchasing_analysis_df

,Purchase Count,Average Purchase Price,Total Purchase Value
Female,113,3.20,361.94
Male,652,3.02,1967.64
Other / Non-Disclosed,15,3.35,50.19

## Age Demographics

* Establish bins for ages


* Categorize the existing players using the age bins. Hint: use pd.cut()


* Calculate the numbers and percentages by age group


* Create a summary data frame to hold the results


* Optional: round the percentage column to two decimal points


* Display Age Demographics Table

In [196]:
bins = [0, 9.9, 14.9, 19.9, 24.9, 29.9, 34.9, 39.9, 100]
group_names = ["<10", "10-14", "15-19", "20-24", "25-29", "30-34", "35-39", "40+"]

In [197]:
purchase_data["Age Ranges"] = pd.cut(purchase_data["Age"], bins, labels=group_names)
purchase_data.tail()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price,Age Ranges
775,775,Aethedru70,21,Female,60,Wolf,3.54,20-24
776,776,Iral74,21,Male,164,Exiled Doomblade,1.63,20-24
777,777,Yathecal72,20,Male,67,"Celeste, Incarnation of the Corrupted",3.46,20-24
778,778,Sisur91,7,Male,101,Final Critic,4.19,<10
779,779,Ennrian78,24,Male,50,Dawn,4.60,20-24

In [198]:
age_count = purchase_data["Age Ranges"].value_counts()

In [199]:
percent_age_count = age_count / active_players * 100

In [200]:
demographics_df = pd.DataFrame({"Total Count":age_count, "Percentage of Players": percent_age_count.round(2)})

In [201]:
demographics_df.sort_index()

       Total Count  Percentage of Players
<10             23                   3.99
10-14           28                   4.86
15-19          136                  23.61
20-24          365                  63.37
25-29          101                  17.53
30-34           73                  12.67
35-39           41                   7.12
40+             13                   2.26

## Purchasing Analysis (Age)

* Bin the purchase_data data frame by age


* Run basic calculations to obtain purchase count, avg. purchase price, avg. purchase total per person etc. in the table below


* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [353]:
bins = [0, 9.9, 14.9, 19.9, 24.9, 29.9, 34.9, 39.9, 100]
group_names = ["<10", "10-14", "15-19", "20-24", "25-29", "30-34", "35-39", "40+"]

In [359]:

purchase_data["Purchase Ranges"] = pd.cut(purchase_data["Age"], bins, labels=group_names)

In [360]:
purchase_range_group = purchase_data.groupby("Purchase Ranges")

In [362]:
average_price = purchase_range_group["Price"].mean()

In [365]:
total = purchase_range_group["Price"].sum()

In [363]:
purchase_count = purchase_data["Purchase Ranges"].value_counts()

In [364]:
purchase_count

20-24    365
15-19    136
25-29    101
30-34     73
35-39     41
10-14     28
<10       23
40+       13
Name: Purchase Ranges, dtype: int64

In [369]:
purchase_analysis_df = pd.DataFrame({"Purchase Count":purchase_count, "Average Purchase Price": average_price, "Total Purchase Value": total.round(2)})

In [370]:
purchase_analysis_df["Total Purchase Value"] = purchase_analysis_df["Total Purchase Value"].map("${:,}".format)
purchase_analysis_df["Average Purchase Price"] = purchase_analysis_df["Average Purchase Price"].map("${:.2f}".format)

purchase_analysis_df.sort_index()

       Purchase Count Average Purchase Price Total Purchase Value
10-14              28                  $2.96               $82.78
15-19             136                  $3.04              $412.89
20-24             365                  $3.05            $1,114.06
25-29             101                  $2.90               $293.0
30-34              73                  $2.93               $214.0
35-39              41                  $3.60              $147.67
40+                13                  $2.94               $38.24
<10                23                  $3.35               $77.13

,Purchase Count,Average Purchase Price,Total Purchase Value,Avg Total Purchase per Person
10-14,28,$2.96,$82.78,$3.76
15-19,136,$3.04,$412.89,$3.86
20-24,365,$3.05,"$1,114.06",$4.32
25-29,101,$2.90,$293.00,$3.81
30-34,73,$2.93,$214.00,$4.12
35-39,41,$3.60,$147.67,$4.76
40+,13,$2.94,$38.24,$3.19
<10,23,$3.35,$77.13,$4.54

## Top Spenders

* Run basic calculations to obtain the results in the table below


* Create a summary data frame to hold the results


* Sort the total purchase value column in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the summary data frame

             Purchase Count Average Purchase Price Total Purchase Value
SN
Lisosia93                 5                  $3.79               $18.96
Idastidru52               4                  $3.86               $15.45
Chamjask73                3                  $4.61               $13.83
Iral74                    4                  $3.40               $13.62
Iskadarya95               3                  $4.37               $13.10

## Most Popular Items

* Retrieve the Item ID, Item Name, and Item Price columns


* Group by Item ID and Item Name. Perform calculations to obtain purchase count, item price, and total purchase value


* Create a summary data frame to hold the results


* Sort the purchase count column in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the summary data frame

In [405]:
popular_items_df = purchase_data.loc[:, ["Item ID", "Item Name", "Price"]]

In [406]:
a = popular_items_df.groupby(["Item ID"])

In [407]:
a

In [408]:
p_counts = popular_items_df["Item ID"].value_counts()

,,Purchase Count,Item Price,Total Purchase Value
Item ID,Item Name,,,
178,"Oathbreaker, Last Hope of the Breaking Storm",12,$4.23,$50.76
145,Fiery Glass Crusader,9,$4.58,$41.22
108,"Extraction, Quickblade Of Trembling Hands",9,$3.53,$31.77
82,Nirvana,9,$4.90,$44.10
19,"Pursuit, Cudgel of Necromancy",8,$1.02,$8.16

## Most Profitable Items

* Sort the above table by total purchase value in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the data frame

,,Purchase Count,Item Price,Total Purchase Value
Item ID,Item Name,,,
178,"Oathbreaker, Last Hope of the Breaking Storm",12,$4.23,$50.76
82,Nirvana,9,$4.90,$44.10
145,Fiery Glass Crusader,9,$4.58,$41.22
92,Final Critic,8,$4.88,$39.04
103,Singed Scalpel,8,$4.35,$34.80